// - Є змінна х, якій ви надаєте довільне числове значення.
// Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'.
// Перевірте  скрипт при a, що дорівнює 1, 0, -3
// let x = +prompt('ведіть чісло')
// if (x !== 0) {
//     document.write('Вірно')
// } else if (x === 0){
//     document.write("Невірно")
// }

// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить,
// до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
// let time = +prompt("напиши число від 0 до 59");
// if (time >= 1 && time < 15) {
//     document.write("Це число відноситься до 1ї четверті!")
// } else if (time >= 15 && time < 30) {
//     document.write("Це число відноситься до 2ї четверті!")
// } else if (time >= 30 && time < 45) {
//     document.write("Це число відноситься до 3ї четверті!")
// } else if (time >= 45 && time < 59) {
//     document.write("Це число відноситься до 4ї четверті!")
// }

// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє
// це число (у першу, другу чи третю).
// let day = 9;
// if (day > 1 && day < 10) {
//     document.write("це 1 декада місяця")
// } else if (day > 10 && day < 20) {
//     document.write("це 2 декада місяця")
// } else if (day > 20 && day < 31) {
//     document.write("це 3 декада місяця")
// }

// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер
// дня тижня і на екрані відображається інфа що заплановано на цей день (можна замість плану
// на день, назву дня англійською).
// let rozklad = +prompt('Який сьогодні день тижня?');
// switch (rozklad) {
//     case 1:
//         document.write('5 уроків')
//         break
//     case 2:
//         document.write('5 уроків')
//         break
//     case 3:
//         document.write('9 уроків')
//         break
//     case 4:
//         document.write('7 уроків')
//         break
//     case 5:
//         document.write('5 уроків')
//         break
//     case 6:
//         document.write('Вихіжний')
//         break
//     case 7:
//         document.write('Вихіжний')
//         break
//     default:
//         document.write('Error')
// }

//
// - Користувач вводить або має два числа. Потрібно знайти та вивести максимальне число з тих двох .
//Також потрібно врахувати коли введені рівні числа.
// const a =+prompt ('введіть перше число')
// const b = +prompt('введіть друге число')
// if(a>b){
//     document.write(a)
// }else if (a<b) {
//     document.write(b)
// }else if(a===b){
//     document.write("вони рівні!!!!!!!!!!!!!!!!!!!!")
// }

